Revit 2027 API
ElementTypeDuplicatedEventArgs.NewName Property
 The name of the newly duplicated ElementType.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string NewName { get; }
Public ReadOnly Property NewName As String
	Get
public:
property String^ NewName {
	String^ get ();
}
member NewName : string with get
Property Value
String
See Also
Reference
ElementTypeDuplicatedEventArgs Class
Autodesk.Revit.DB.Events Namespace